<h2>Функции массивов</h2>
<?php

// Функции массивов
$arr = [1,2,3,4];

// Вставка/извлечение элементов с конца

// Вставка/извлечение элементов с начала

// Получение части массива

// Разделение одного массива на несколько

// Слияние массивов

// получить только ключ массива

// получить только значения

// Обход массива

// Рекурсивный обход
$arr = [
    ['one' => 1,  2, 3, 4, 5],
    10 => [11,12,13,14,15],
    [21,22,23,24,25]
];

$students = [
    "std6454" => "Вася",
    "std9405" => "Петя",
    "std3685" => "Даша",
    "std7406" => "Саша",
    "std746" => "Саша",
    "std2764" => "Рита",
    "std283" => "Гена"
];

// Сортировки

// сортировка по возрастанию без сохранения ключей

// сортировка по убыванию без сохранения ключей

// сортировка по значениям по возрастанию с сохранением ключей

// сортировка по значениям по убыванию с сохранением ключей

// сортировка по ключам по возрастанию

// естественная сортировка

// пользовательская сортировка по значениям

// аналогично пользовательская сортировка
// с сохранением ассоциации с ключами

// ... и по ключам

$arr = array(
    array("10", 11, 100, 100, "a"),
    array(   1,  2, "2",   3,   1)
);

// многомерная сортировка

// перемешивание без сохранения ключей

// Получить колонку 'name' массива $table
$table = [
    0 => [
        "id" => 0,
        "name" => 'first'
    ],
    1 => [
        "id" => 1,
        "name" => 'second'
    ],
    2 => [
        "id" => 2,
        "name" => 'third'
    ]
];

// Без функции array_column
foreach ( $table as $row ) {
    if (array_key_exists ( 'name', $row )) {
        $arr [] = $row ['name'];
    }
}
//print_array ( $arr );
clear_globals ( [
    'table'
] );

// С функцией array_column

clear_globals ();
// -------------------------------------------------------------------------
// Создать массив из переменных $a,$b,...$e
$a = 1;
$b = 2;
$c = 3;
$d = 4;
$e = 5;

// Без функции compact
$arr = [
    'a' => $a,
    'b' => $b,
    'c' => $c,
    'd' => $d,
    'e' => $e
];
//print_array ( $arr );

// С функцией compact

clear_globals ();
// -------------------------------------------------------------------------
// Извлекает переменные из массива
$arr = [
    'user' => 'basename',
    'password' => '12345',
    'email' => 'mail@mail.com'
];

// без функции extract
$user = 'test'; // $arr ['user'];
$password = $arr ['password'];
$email = $arr ['email'];

// clear_globals (['arr']);
// с функцией extract


//echo "user: $user password: $password email: $email" . nl2br ( "" );

// -------------------------------------------------------------------------
// Сгенерировать числовой массив 0..9
// Без функции range
clear_globals ();
for($i = 0; $i < 10; $i ++) {
    $arr [] = $i;
}
//print_array ( $arr );

// С функцией range
clear_globals ();

clear_globals ();

// -------------------------------------------------------------------------
// Найти все нечетные значения числового массива
$arr = range ( 0, 10 );
// Без функции array_filter
foreach ( $arr as $k => $v ) {
    if ($v % 2) {
        $odds [$k] = $v;
    }
}
//print_array ( $odds );
clear_globals ( [
    'arr'
] );

// с функцией array_filter

//print_array ( $odds );
clear_globals ();

// -------------------------------------------------------------------------
// Заполнить массив одинаковыми значениями
// Без функции array_fill
for($i = 0; $i < 10; $i ++) {
    $arr [$i] = "value";
}
//print_array ( $arr );
clear_globals ();

// С функцией array_fill

clear_globals ();

// -------------------------------------------------------------------------
// Найти произведение элементов массива
$arr = range ( 1, 10 );

// Без функции array_reduce
$prod = 1;
foreach ( $arr as $v ) {
    $prod = $prod * $v;
}
//print ("\$prod = " . $prod . "<br />") ;
clear_globals ( [
    'arr'
] );

// С функцией array_reduce

clear_globals ();

// -------------------------------------------------------------------------
// Извлечение значений элементов массива в переменные $a, $b, $c
$arr = [
    'one',
    'shome data',
    'two',
    'three'
];
// Без list()
$a = $arr [0];
$b = $arr [1];
$c = $arr [2];
//echo "\$a = $a \$b = $b \$c = $c <br />";
clear_globals ( [
    'arr'
] );

// С list

clear_globals ();

// -------------------------------------------------------------------------
// Перебрать элементы ассоциированного массива без ключей
$arr = [
    'k1' => 'v1',
    'k2' => 'v2',
    'k3' => 'v3'
];

// Без функций current (pos), reset, prev, next, end
foreach ( $arr as $value ) {
    //echo "$value <br />";
}

// С функциями current (pos), reset, prev, next, end

// -------------------------------------------------------------------------
// Перебрать элементы ассоциированного массива с ключами
$arr = [
    'k1' => 'v1',
    'k2' => 'v2',
    'k3' => 'v3'
];

// Без функции each
foreach ( $arr as $key => $value ) {
    //echo "$key => $value <br />";
}

// С функциями current (pos), reset, prev, next, end
