<h2>Строки в PHP</h2>

<?php

	// Длинна строки

	// Подсчет количества слов в строке

	// Преобразование к нижнему регистру
	
	// Преобразование к верхнему регистру
	
	// Реверс строки
		
	// Сравнение строк

	// Поиск заданного текста внутри строки

	// Получение подстроки

	// Часть строки

	// Замена текста
	
	// Повторение строки

	// Начальные, конечные пробелы в строке	

	// Удаление всех html и php тегов	

	// Преобразование специальных симовлов
	
	// Обратное преобразование в сущности html
	
	// Таблица преобразования


		
